Repository: Lilium27/Creating-Intelligent-Content-with-Lightweight-DITA-Translation-Project
Catalog: omegat/project_save.tmx
Source language: en
Languages: zh_cn

source: The content needs of the company now are many: they will need guides for workers in the corporate-owned restaurants, guidelines and expectations for franchise owners, and because of the nature of this business (restaurants), they will also require collections of recipes and acceptable ingredients that can be reused in end-user products like a menu for print and online channels.
zh_cn: 目前，公司在内容上有很多需求：他们需要制作指导企业餐厅员工的手册，管理品牌特许经营权所有者的指导方针和期望。与此同时，因为餐饮行业的本质所需，他们还要集中管理受顾客喜爱的菜谱和原料，以便在打印版菜单或在线菜单等终端用户产品中复用。

source: The conventions he identified had the purpose of keeping the document's contents in order and make it easier to access for a reader.
zh_cn: 他界定惯例的目的是使文档保持有序并使得读者更易获得所需信息。

source: The core components of a LwDITA map that can be
zh_cn: HDITA 中包含的 LwDITA 地图的核心组件

source: The definitions for some characteristics, however, have changed slightly over time.
zh_cn: 然而，一些特征的定义随着时间的推移略有变化。

source: The demise of the manual is an event that affects genre theory and technical communication, as this was the flagship format that the profession produced for decades and, for some, justified its existence as an academic subject and area of practice.
zh_cn: 手册的消亡影响了体裁理论和技术传播，因为手册是这一职业使用了数十年的标志性形式，对于一些人而言，捍卫手册可以作为学术主题和实践领域而存在。

source: The descriptions and examples featured in this chapter (and in Chapter 6) are based on work that I have conducted as lead author of official OASIS publications, which include the committee note Lightweight DITA: An Introduction (Evia et al., 2018) and the LwDITA technical specification, which I am currently editing with Michael Priestley.
zh_cn: 本章的介绍和示例（第6章中也有部分示例）基于我作为 OASIS 官方出版物第一作者的经历所写，这些出版物包括该委员会文件《轻量级 DITA 简介》(Evia et al., 2018) 和《LwDITA 技术规范》，后者目前正由我与迈克尔·普利斯特里编写。

source: The document type of map enables this grouping of topics.
zh_cn: 这得益于地图（map）文档类型，

source: The element <stepresult>, which is a child of the element <step>, provides possible responses to the actions conducted by users.
zh_cn: 元素<stepresult>是元素<step>的子元素，提供对用户操作的可能响应。

source: The element types in DITA also inherited generic, institutional, and disciplinary conventions from another title that was originally published in the 1980s: IBM's Producing Quality Technical Information.
zh_cn: DITA的元素类型同样继承了IBM在20世纪80年代首次出版的《产出高质量技术信息》一书中的通用型、组织型和规范型惯例。

source: The essential unit of content in LwDITA is a topic, which is represented in XDITA with the XML tag <topic> .
zh_cn: LwDITA的基本内容单元是话题，话题在 XDITA 中用 XML 标签 <topic> 表示。

source: The evolution of DITA is taking shape after several branches, with LwDITA as one of those possible paths for growth.
zh_cn: DITA 的进化在经历了几个分支版本后已经初具形态，LwDITA 是其中一种可能的增长途径。

source: The example in Figure 6.14 adds a body component, with a paragraph, to the franchise introduction topic in XDITA:
zh_cn: 图6.14展示一个 XIDTA 格式的话题示例，介绍了特许经济区，该示例包含主体组件和段落组件。

source: The examples included in the following sections, and continued in Chapter 6, are based on this scenario:
zh_cn: 下面几节以及第6章中的示例都是基于此概念而来的:

source: The examples included in this chapter continue the scenario of Chef Pedro's content requirements for the promotional Sensei Sushi brochure.
zh_cn: 本章将继续以厨师佩德罗身处的场景为例，围绕 Sensei Sushi 宣传手册的内容需求展开。

source: The file will now clear validation in LwDITA-aware apps and also shows actual content for human readers.
zh_cn: 该文件将清除支持 LwDITA 工具显示的验证错误提示，然后为读者展示实际内容。

source: The first line of code in the example is the XML declaration, which announces to the computer processor that this is an XML file and should be treated as such.
zh_cn: 示例中的第一行代码是 XML 声明，告诉计算机处理器这是一个 XML 文件，应该按 XML 文件处理。

source: The first line of code in the file is establishing that the HDITA topic should be validated as HTML.
zh_cn: 文件中的第一行代码表明应该按照HTML格式识别HDITA话题。

source: The first list item mixes character data with a child element (a paragraph in this case).
zh_cn: 第一个列表项将字符数据与子元素(本例中为段落)混合在一起。

source: The first topic reference in the DITA map from Figure 5.1 is the DITA task version of the marinara sauce recipe from Chapter 1 (Figure 5.2).
zh_cn: 图5.1展示的 DITA 地图的第一个话题引自第1章中的意式番茄罗勒酱菜谱，它是一个 DITA 任务（task）话题（图5.2）。

source: The fixed content types that have been a part of DITA XML since its origins at IBM have always been open to evolution: an author can write, for example, a task topic with the default elements and attributes included in the DITA standard.
zh_cn: 固定的内容类型一直是DITA XML的一部分，从IBM创建以来就一直拥抱进化：作者可以利用包含在DITA标准中的默认的元素和属性来写作，比如说撰写任务主题。

source: The flavors mapping DITA components to HTML5 and Markdown (HDITA and MDITA, respectively) followed, but the committee also considered mappings to JSON, AsciiDoc, reStructuredText, and even Microsoft Word.
zh_cn: 接着是DITA组件到HTML5和Markdown(分别是HDITA和MDITA)的映射，但是委员会也考虑了到JSON、AsciiDoc、reStructuredText，甚至Microsoft Word的映射。

source: The following chapter introduces the main topic components available in LwDITA.
zh_cn: 下一章将介绍 LwDITA 中主要的话题组件，

source: The following example (Figure 6.19) shows the definition list in MDITA extended profile with an HDITA code snippet.
zh_cn: 图6.19的所示示例包含一段 HDITA 代码片段，该示例展示了如何在 MDITA 扩展配置中使用定义列表。

source: The following scenario combines the examples I have presented so far: Chef Pedro has a website in which he critiques recipes.
zh_cn: 下面的场景结合了到目前为止我展示的所有示例：厨师佩德罗拥有一个评价菜谱的网站。

source: The following section introduces additional topic components that can be included inside the body environment.
zh_cn: 下面将介绍可以嵌套在主体标签内的其他话题组件。

source: The future of technical communication still involves XML; therefore, the following sections include brief introductions to Extensible Markup Language and the Darwin Information Typing Architecture, providing examples of the main content and collection types included in the latter.
zh_cn: 未来技术传播的发展仍然与 XML 有关，因此，接下来本章首先会对 XML 和 DITA 作简要介绍，并提供 DITA 所包含的主要内容和集合类型的示例。

source: The future of technical communication, as seen from industry and academia, was supposed to cover the type of structured writing for reuse that James Mathewson was looking for.
zh_cn: 从工业界和学术界的角度来看，技术传播的未来应该包括詹姆斯•马修森所追寻的可重用的结构化写作类型。

source: The generic topic, with its simple tags for paragraphs and lists, can mark up a marketing blog post.
zh_cn: 通用话题包含关于段落和列表的简单标签，可以标记一篇营销博文。

source: The goal is to create a lightweight DITA framework that can ease adoption for casual, contributing, or non-technical authors.
zh_cn: 我们的目标是创建一个轻量级DITA框架，它可以方便临时的、辅助性的或非技术写作人员的作者使用。

source: The groups were organized around the categories of learning and training, machine industries, software development, and marketing.
zh_cn: 这些小组围绕学习和培训、机器工业、软件开发和市场营销等领域进行组织。

source: The ice cream analogy also implies that authoring content is the fun part of a LwDITA-based publishing workflow.
zh_cn: 冰淇淋比喻还表明创作内容是基于轻量级DITA发布工作流有趣的组成部分。

source: The ice cream flavors analogy indicates the variety of offerings from LwDITA for authors, who no longer have to depend on XML structures to create topics of information that can be transformed into intelligent content and multichannel deliverables for users.
zh_cn: 冰激凌口味的比喻说明了LwDITA为作者提供的各种产品，作者不再需要依赖XML结构来为用户创建可以转换为智能内容和多渠道可交付内容的信息主题。

source: The implementation of quality characteristics into actual XML elements and conventions is all over those three parts, but it is mainly represented in the work to be performed by authors as part of their work to “fix the content” by categorizing topics by type of information.
zh_cn: 这三个部分贯穿了将质量特征运用到实际的XML元素和惯例的过程，但它主要体现在作者要完成的工作中，即通过按信息类型对主题进行分类来“固定内容”。

source: The information contained in Chapters 5 and 6 does not aim to be a complete tutorial on XML, HTML5, or Markdown.
zh_cn: 编写第 5章和第6章的目的并不是提供一个关于 XML、HTML5 或 Markdown 的完整教程。

source: The layers of abstraction did not have the specific goal of assessing if students became computational thinkers; thus, they were not directly inspired by a strict rubric like the ISTE standards.
zh_cn: 抽象层级并不旨在评估学生是否具有计算机思维能力，因此，抽象层级不是因为直接受到像ISTE那样严格的标准的启发而出现的。

source: The layers of abstraction of authoring in a workflow with LwDITA are related to the stages on a content development lifecycle.
zh_cn: 在LwDITA工作流中，写作涉及的抽象层级与内容开发生命周期的各个阶段息息相关。

source: The level-one heading that provides a title for an MDITA topic can be expressed, according to the GitHub Flavored Markdown (GFM) spec, both with an atx
zh_cn: 根据 GitHub 风格的 Markdown 规范 (GFM)，MDITA 话题中的一级标题，既可以使用 atx

source: The limited DITA profile was presented as an on-ramp for DITA users who were casual content contributors and did not need all the standard's features.
zh_cn: 限定版DITA概要是临时的内容写作者和不需要使用 DITA 所有特性的用户接触 DITA 的入口。

source: The list items reference specific topics, and the heading one (in bold font) provides the main title for deliverables produced with this specific map.
zh_cn: 列表项引用特定话题，一级标题（粗体的部分）为使用此地图生成的交付成果提供主标题。

source: The literature focuses on three topic types that “represent the vast majority of content produced to support users of technical information” (Hackos, 2011, p.7): concept, task, and reference, which Pringle & O'Keefe define succinctly as follows:
zh_cn: 文档主要有三种话题类型，它们“代表了为了帮助用户而产生的技术信息文档里的绝大多数内容”（哈克斯，2011年，第7页）：概念（concept）、任务（task）和参考（reference），普林格尔（Pringle）和奥基夫对其的简短定义如下：

source: The mandate of “go learn about intelligent content and then bring it back to your classroom and research agenda” has been ineffective for many years as a way to convince technical communication faculty and graduate students about the importance of industry practices.
zh_cn: 多年来，为了让技术传播学院的教师和研究生相信行业实践的重要性，一直在要求他们“学习创作智能内容，并将其用在课堂上和研究中”，但这个做法收效甚微。

source: The map for creating the Sensei Sushi brochure can also be coded in MDITA.
zh_cn: 创建 Sensei Sushi 手册的地图也可以使用 MDITA 格式语言。

source: The map includes links (or topic references) to the marinara sauce recipe, Chef Pedro's critique of the recipe, and an “about” page with information about the author.
zh_cn: 地图上有关联到意式番茄罗勒酱食谱、厨师佩德罗对菜谱的评价和介绍作者信息的“关于”页面的链接（或话题引用）。

source: The minimalist approach not only yields a reduction in page count, but it also results in writing that doesn't get in the user's way.
zh_cn: 极简主义方法并不只是减少了页数，而且使得写作顺应用户的需求。

source: The new version of the basic XDITA topic should look as Figure 6.6.
zh_cn: 新标准中的 XDITA 基本话题如图6.6所示

source: The next chapter focuses on the features and limitations of XDITA, HDITA, and MDITA - the initial LwDITA authoring formats.
zh_cn: 下一章将重点讨论最初的 LwDITA 写作格式 XDITA、HDITA 和 MDITA 的特性以及局限。

source: The next line of code in the
zh_cn: 示例中的下一行代码

source: The next section focuses on the number of elements included in the DITA standard across its releases.
zh_cn: 下一节将重点讨论DITA标准各个版本中包含的元素数量。

source: The next section introduces a DITA-based approach to intelligent content that has the potential of minimizing the standard's learning curve and promoting its adoption in small and medium scale information authoring and processing environments as well as classrooms.
zh_cn: 下一节将介绍一种基于 DITA 的智能内容创建方法，该方法具有最小化 DITA 标准学习成本的潜力，并可以促进创作者在中小规模的信息创作和处理环境（如课堂）中使用 DITA。

source: The obsession shaped the old flagship genre, as heavy computer manuals established rules for data processing, ordered sections according to product features, and forced readers to follow a specific instruction and consultation pattern.
zh_cn: 这种痴迷塑造了旧的标志性体裁，厚重的计算机手册为数据处理设定了标准、根据产品特征规定了部分划分并迫使读者遵循特定的指导和咨询模式。

source: The only components included in an MDITA version of the brochure map would be a title (represented by a Markdown atx heading of # in this case) and list items (-) that include links to each topic and its navigation title.
zh_cn: MDITA格式的手册地图中包含的唯一组件是标题（在本例中用 Markdown 中的 # 表示标题）和列表项 (-) ，列表项将提供关联到到每个话题的连接，并形成导航标题。

source: The opening and closing XML tags for topic (in bold font) create an environment for content.
zh_cn: 用于标记话题开始和结束 XML 标记（图中粗体部分）创建了内容写作环境。

source: The opening and closing tags of <shortdesc> hold content that the authors can use as a staging rhetorical move in the topic.
zh_cn: 创作者可以使用简短描述组件作为话题阶段过渡的修辞文步，过度内容嵌套在 <shortdesc> 的开始和结束标签之内。

source: The ordered list would look as follows (Figure 6.21) in HDITA:
zh_cn: 在 HDITA 中，有序列表看起来如图6.21所示：

source: The original DITA 1.0 technical specification is still available on the DITA Technical Committee website1.
zh_cn: DITA技术委员会的网站上还能找到原始的DITA 1.0 技术规范。

source: The original quality requirements from PQTI, organized in categories and specific actions under each category, were the following:
zh_cn: PQTI首度提出的质量要求, 都分门别类地组织起来，每个类别下都有具体动作，如下所示：

source: The origins of DITA introduced the topic as a chunk of information with the following characteristics:
zh_cn: 最初的DITA引进主题作为信息块，有以下特征：

source: The other list items do not mix character data with elements.
zh_cn: 其他列表项不会将字符数据与元素混合。

source: The overlap, despite apparent and actual differences, in the DITA XML and rhetorical discussion of topics and commonplaces highlights the practical applications of topics, and also their perceived limitations.
zh_cn: 尽管两者存在明显且实际的差异，但DITA XML与有关主题和常规的修辞讨论重叠的部分突出了主题的实际应用，以及它们的局限性。

source: The perception is that little explanation is needed.
zh_cn: 人们的看法是，这几乎不需要解释。

source: The plan sheets from Cohen and Cunningham covered the following conventions of the manual as a genre of technical writing:
zh_cn: 柯亨和坎宁安提出的计划表包含以下内容，这些内容同样是作为技术写作体裁存在的手册所遵循的惯例：

source: The popular John Godfrey Saxe quote, commonly misattributed to Otto von Bismarck, says that “laws, like sausages, cease to inspire respect in proportion as we know how they are made.” Web designer Jeffrey Veen, in his podcast titled Presentable, added standards to that list (Veen, 2017).
zh_cn: 著名的约翰·戈弗雷·萨克森（John Godfrey Saxe）曾说过，“法律就像香肠一样，当我们知道它是如何被制造出来的时候，它就不会再得到人们的尊重了。”这句话通常被误传为奥托·冯·俾斯麦（Otto von Bismarck）所说。网页设计师杰弗里·维恩（Jeffrey Veen）在他名为《得体》（Presentable）的播客中，将各种标准也加入到节目内容当中（维恩，2017年）。

source: The prerequisites were already present in the example from Chapter 1, in the <prereq> element, which includes an unordered list (<ul>) with list items (<li>) for all the ingredients the user would need to complete the recipe.
zh_cn: 第一 章的案例已经展示了先决条件，都包含在在<prereq>元素中，其中包括一个无序列表(<ul>)和列表项(<li>)，用于用户完成菜谱所需的所有配料。

source: The previous example shows the “minimize mixed content” rule in action.
zh_cn: 前面的示例展示了“最小化混合内容”的规则。

source: The previous examples did not have much content but are all valid LwDITA topics.
zh_cn: 前面展示的示例虽然内容不多，但都是有效的 LwDITA 主题，

source: The primary component inside a body is a paragraph, which should be represented by opening and closing <p> tags.
zh_cn: 主体组件内部主要是段落组件，段落组件由一对 <p> 标签表示。

source: The process for generating end user deliverables from DITA maps is the same for transforming LwDITA maps (regardless of XDITA, HDITA, or MDITA authoring format).
zh_cn: 从DITA地图生成用户交付物的过程与从 LwDITA 地图（XDITA、HDITA 或 MDITA 写作格式皆可）生成交付物的过程是一样的。

source: The process of assembling topic collections depends on DITA maps, which are defined as “the glue that binds your topics together, the driver for producing your output, and the information path for your users to follow” (Bellamy et al., 2012, p.
zh_cn: 组合话题集合的过程依赖于 DITA 地图的映射关系，DITA 地图是“将话题绑定在一起的粘合剂，是生成输出物的驱动器，也是用户可以遵循的信息路径”（贝拉米等人，2012年，第

source: The process of identifying, documenting, and implementing common structures to preserve order and rules in the content produced by technical and professional communicators follows a longstanding tradition of applied rhetoric in writing studies.
zh_cn: 为了保证职业技术传播工程师创建的内容的秩序和规则，确定、记录和采用通用结构的过程必须遵从一个长期存在的传统，而这个传统即为写作研究中的应用修辞。

source: The process of seeing the milkshake flavor as a variable in one layer, with additional ingredients as constants in another layer, the placement of specific requirements and steps in a third layer, and computing rules to create a unique recipe for readers in yet another layer requires, like Chef Pedro's content needs for the Sensei Sushi publications from previous chapters, a different kind of thinking from the author.
zh_cn: 看到奶昔口味的过程作为一个变量在第一层，额外的原料作为常量在第二层，具体要求和步骤在第三层，为读者编写独特食谱的计算机规则又在另一层，像前几章提到的厨师佩德罗对 Sensei Sushi出版物的内容需求一样，这需要作者有不同的思维模式。

source: The process sounds simple, and the content components in the DITA task document type seem just right for structuring a recipe.
zh_cn: 这个过程听起来很简单，DITA 任务（task）文档类型中的内容组件似乎正好适合构建结构化菜谱，

source: The promise: a centralized content repository structured in XML can be the source for many user deliverables.
zh_cn: XML 结构的集中化内容存储库可以作为许多用户交付内容的信息来源。

source: The proposal for a lightweight version of the DITA standard crossed an important border in the spring of 2014.
zh_cn: 2014年春天，关于开发 DITA 标准轻量级版本的提议迈过了重要一砍。

source: The proposed standard focused on only two
zh_cn: 在最初的版本中，提议的标准只关注两种

source: The quadrants, and related decisions, included in Bailie & Urbina's content lifecycle are as follows:
zh_cn: 拜利和厄比纳提出的内容生命周期模型所包含的象限和相关决策如下：

source: The quality characteristics in all the available editions of DQTI follow the same structure.
zh_cn: DQTI所有可用版本的质量特征遵循相同的结构。

source: The quality guidelines for technical information that had been driving the work of authors, editors, and reviewers at IBM since the 1980s were put into practice in the content types and elements included in DITA XML.
zh_cn: 自从20世纪80年代以来，技术信息的质量指导原则一直在推动IBM的作者、编辑和审稿人的工作，现在已经在DITA XML中包含的内容类型和元素中付诸实践。

source: The quality technical information model of nine characteristics is flexible enough to support you as you develop ever smaller chunks of information to address the changing needs of users.
zh_cn: 包含九个特征的质量技术信息模型足够灵活，可以在开发更小信息块时给予支持，以便以满足用户不断变化的需求。

source: The rationale for the task is in the <context> element; it represents the conventional move of telling the user when or why to complete the procedure/ recipe.
zh_cn: 任务的合理解释包含在<context>元素中；它是一种惯例文步，告诉用户何时或为何要完成这一步骤/食谱。

source: The recipe has a strong structure with visible sections.
zh_cn: 菜谱结构固定，各个组成部分清晰明了。

source: The recommendations and models presented in this book come from my experience teaching DITA and LwDITA at the college level and in industry workshops and conferences.
zh_cn: 本书中提及的建议和模型来自于我在大学以及各种行业会议上教授 DITA 和 LwDITA 的经验，

source: The recorded minutes of the DITA Technical Committee call held on October 8, 2013 include the following exchange between Priestley (MP) and Nancy Harrison (NH), from Infobridge Solutions, who is currently the Technical Committee's secretary:
zh_cn: DITA 技术委员会电话记录中记录了2013年10月8日普里斯特利（MP）和南希·哈里森（NH）之间的对话，南希·哈里森来自Infobridge Solutions，目前是技术委员会的秘书：

source: The rest of the manual can be used to expand where necessary” (1976, p.
zh_cn: 手册剩余的内容则可按需分配。”(1976, p.

source: The resulting HTML5 files should appear automatically (after a few minutes) in the DITA-OT out folder, although you can specify an alternative folder in the build command with the --output option.
zh_cn: 生成的 HTML5 文件应该（几分钟后）自动出现在 DITA-OT 中的 out 文件夹里，你也可以使用 build 命令中的 --output 选项指定另一个文件夹。

source: The resulting PDF should look very similar to the one produced with the XDITA and HDITA maps, as the end users do not need to know which LwDITA authoring format was used to create the brochure.
zh_cn: 生成的 PDF 应该与使用 XDITA 和 HDITA 地图生成的 PDF 非常相似，因为终端用户不需要知道创建手册到底使用了哪种 LwDITA 写作格式。

source: The resulting PDF should look very similar to the one produced with the XDITA map, as the end users do not need to know which LwDITA authoring format was used to create the brochure.
zh_cn: 生成的 PDF 应该与使用 XDITA 地图生成的 PDF 非常相似，因为终端用户不需要知道创建手册到底使用了哪种 LwDITA 写作格式。

source: The resulting files appear automatically (after a few minutes) in a folder named out that Oxygen will create in the same folder where the map is located.
zh_cn: Oxygen 会在地图所在的同一个文件夹中创建一个名为 out 的文件夹，生成的文件（几分钟后）会自动出现在 out 文件夹中。

source: The revised layers expand beyond the content acquisition stage and cover from planning to evaluation and revision.
zh_cn: 修订后的抽象层级进行了扩展，不仅限于内容获取阶段，涵盖了规划、评估、修订等阶段。

source: The revised proposal of April 2014 had the goal “to align a lightweight DITA profile in XML with an equivalent markup specification based on HTML5” (Priestley, 2014).
zh_cn: 2014年4月，委员会对提案进行了修订，修订后的提案目标是“使基于 XML 的轻量级 DITA 的标记规范与基于 HTML5 的标记规范保持一致” (Priestley, 2014)。

source: The revised topic type depended on a series of constraint declarations that would give instructions to DITA processors.
zh_cn: 修改后的话题类型依赖于一系列约束声明，这些声明将向DITA处理器提供指令。

source: The rhetorical topics are the moves/elements inside a DITA topic: the element of, say, <prereq> for prerequisites in a task topic suggests a shared model common to all tasks and procedures that allows authors to produce viable how-to information.
zh_cn: 修辞主题是DITA主题中的文步/元素：例如，任务主题中的先决条件<prereq> 的元素表示所有任务和流程共有的共享模型，该模型允许作者生成可行的“如何做”信息。

source: The sample file includes an unordered list (<ul>) that contains three list items (<li>).
zh_cn: 示例文件包括一个无序列表（<ul>）其中包含三个列表项（<li>）。

source: The sample files are available for download from the Creating Intelligent Content with Lightweight DITA GitHub repository (https://github.com/carlosevia/ lwdita-book).
zh_cn: 你可以从Creating Intelligent Content with Lightweight DITA GitHub 仓库 (https://github.com/carlosevia/ lwdita-book)下载样例文件。

source: The sample topic includes an unordered list (<ul>) that contains three list items (<li>).
zh_cn: 示例主题包括一个无序列表（(<ul>），其中包含三个列表项（<li>）。

source: The second edition provided new details on the difference between the guidelines and the elements (topical conventions) that put those guidelines into practice.
zh_cn: 第二版提供了新的细节信息，阐明指导方针和将方针运用到实践中的元素（主题惯例）间的区别。

source: The second half of 2014 marked the real genesis of the LwDITA standard.
zh_cn: LwDITA 标准真正诞生于2014年下半年。

source: The second line indicates that this is not just any XML file, and that it must be validated against the document type definition (DTD) of lw-topic.dtd, which is a grammar file that includes the XDITA syntax rules and was created by the Lightweight DITA subcommittee at OASIS.
zh_cn: 第二行代码表明这不是普通的 XML 文件，它必须按照 lw-topic.dtd 文档类型定义 (DTD) 进行验证。lw-topic.dtd 是一个语法文件，由 OASIS 的轻量级 DITA 小组委员制定，包含 XDITA 语法规则。

source: The second line points out that the topic is not just a regular XML file, but that is complies with the structuring rules described in the document type definition (DTD) of “topic” from the DITA standard.
zh_cn: 第二行指出，主题不仅仅是一个常规XML文件，而且它符合DITA标准中“主题”的文档类型定义(DTD)中描述的结构规则。

source: The second line points out that the topic is not just a regular XML file, but that is complies with the structuring rules described in the document type definition (DTD) of “task” from the DITA standard.
zh_cn: 第二行指出，主题不仅仅是一个常规XML文件，而且它符合DITA标准中“主题”的文档类型定义(DTD)中描述的结构规则。

source: The second topic reference is the actual critique of the marinara sauce recipe, which can be structured as a DITA concept and look as Figure 5.3.
zh_cn: 第二个话题引自对意式番茄罗勒酱菜谱的实际评价，它被构造成了DITA 概念（concept）话题，如图5.3所示。

source: The sections identified in Rigo's outline provide a rich description of the genre's rhetorical conventions (or at least those identified by the author), which include the following:
zh_cn: 里戈在大纲中定义的章节详尽地阐述了体裁的修辞惯例（至少是作者定义的那些惯例），包括以下内容：

source: The short description defaults to the first paragraph in an HTML file.
zh_cn: 简短描述的默认位置为 HTML 文件的第一个段落，

source: The short description is implied in the first paragraph of a Markdown file.
zh_cn: 简短描述隐藏在 Markdown 文件的第一格段落中。

source: The simplified map content model included the following elements:
zh_cn: 简化后的内容模型包括以下元素：

source: The simplified structures in LwDITA have the intention of minimizing authorial decisions when creating content.
zh_cn: LwDITA中简化的结构旨在最大程度减少创建内容时的作者决策。

source: The slow pace ensures that representatives from the larger community worldwide have time to review and comment, adding their perspectives and concerns and, as a consequence, improving the standard.
zh_cn: 缓慢的步伐为来自世界范围内较大社区的代表们提供了审查和评价的时间保障，他们可以增加观点、提出疑虑，从而提高了标准。

source: The spec is a well-organized document that presents details and examples of common topic and element types without overwhelming the readers with a force-feed of its 193 XML tags.
zh_cn: 该规范是一个组织良好的文档，提供了常见主题和元素类型的详细信息和示例，而没有强制用户了解195种XML标记，不至于让他们被大量标签淹没。

source: The standard adds the following indicators for assessing students as computational thinkers:
zh_cn: 该标准增加了以下指标来评估学生的计算机思维能力:
